erp3l/src/Enums/ОперацииЗакрытияМесяца/ОперацииЗакрытияМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииЗакрытияМесяца</name>
  <enumValues>
    <name>АннулированиеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ВводСведенийСреднесписочнойЧисленности</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеРасходовОтВыбытияОС</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеСчетовУчетаДоходовИРасходовМУ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнениеФактическойСтоимостиВНАПриОтключенномУчетеСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеДублейВидовЗапасов</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОтрицательныхОстатковТоваровОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибокВИсходныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибокКорреспонденцииФинансовыхРегистров</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеРазвернутыхОстатковПоВзаиморасчетам</name>
  </enumValues>
  <enumValues>
    <name>НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ</name>
  </enumValues>
  <enumValues>
    <name>НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции</name>
  </enumValues>
  <enumValues>
    <name>НастройкаРаспределенияРасходов</name>
  </enumValues>
  <enumValues>
    <name>НастройкаРаспределенияРасходовВручную</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииНМА</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОС</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииОСиНМАМеждународныйУчет</name>
  </enumValues>
  <enumValues>
    <name>НачислениеОценочныхОбязательствРезервовПоОтпускам</name>
  </enumValues>
  <enumValues>
    <name>НачислениеПроцентовПоАренде</name>
  </enumValues>
  <enumValues>
    <name>НачислениеСписаниеРезервовПредстоящихРасходов</name>
  </enumValues>
  <enumValues>
    <name>НачисленияПоКредитамДепозитамИВыданнымЗаймам</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтУплатыНалоговВСвязиСКоронавирусом</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВМеждународномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеДокументовВРегламентированномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражениеЗарплатыВФинансовомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыкупаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеВыработкиСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеДокументовРаспределенияРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОстатковТоваровКПередаче</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовКомитентамОСписании</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеОтчетовПоКомиссииМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачМатериаловВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПередачТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеПроизводстваБезЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСчетовФактурИТаможенныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаДвиженийПриОтключенномУчетеСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаАренды</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаДенежныхСредствИФинансовыхИнструментов</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаНовыеРежимыУчета</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаУчетВнеоборотныхАктивовВерсии24</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНДСВБюджетПоОтдельнымОперациям</name>
  </enumValues>
  <enumValues>
    <name>ПланированиеПроизводстваПродукцииБезСпецификаций</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСтоимостиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВНалоговомУчетеАрендныхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПоИсследованиямИРазработкам</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПриУСН</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеДоходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции21</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеМатериаловИРаботНаСебестоимостьПродукции22</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеНДС</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовБудущихПериодов</name>
  </enumValues>
  <enumValues>
    <name>РаспределениеРасходовПоНаправлениямДеятельности</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗемельногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазниц</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВВалютеПредставления</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазницВФункциональнойВалюте</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаУСН</name>
  </enumValues>
  <enumValues>
    <name>РасчетПартийИСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>РасчетПроцентныхРасходовДисконтирования</name>
  </enumValues>
  <enumValues>
    <name>РасчетСтоимостиВнеоборотныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>РасчетТорговогоСбора</name>
  </enumValues>
  <enumValues>
    <name>РасчетТранспортногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РеклассификацияДолгосрочныхАктивовОбязательств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗатратНаВыпускБезРаспоряжений</name>
  </enumValues>
  <enumValues>
    <name>СторноДоходовКУДиР</name>
  </enumValues>
  <enumValues>
    <name>УстановкаДатыЗапретаФормированияПроводокМУ</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоВнеоборотнымАктивам</name>
  </enumValues>
  <enumValues>
    <name>АктуализацияПараметровУзловКомпонентовАмортизации</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеДвиженийПоРасчетамСПартнерамиИПереоценкаРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПодОбесценениеЗапасов</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеСводныхСправокНДС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеФинансовогоРезультата</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАмортизацияОС</name>
    <comment>Использовалось до версии 2.4</comment>
  </enumValues>
  <enumValues>
    <name>ОбесценениеВНА</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/ТипыРегламентныхОпераций/ТипыРегламентныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРегламентныхОпераций</name>
  <enumValues>
    <name>ЗакрытиеГода</name>
  </enumValues>
  <enumValues>
    <name>РасчетКурсовыхРазниц</name>
    <comment>Переоценка по плану счетов</comment>
  </enumValues>
  <enumValues>
    <name>РасчетДолейСписанияКосвенныхРасходов</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗемельногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>РасчетОтложенногоНалога</name>
  </enumValues>
  <enumValues>
    <name>РасчетТорговогоСбора</name>
  </enumValues>
  <enumValues>
    <name>РасчетТранспортногоНалога</name>
  </enumValues>
  <enumValues>
    <name>СписаниеКосвенныхРасходов</name>
    <comment>Списание косвенных расходов в части нормируемых</comment>
  </enumValues>
  <enumValues>
    <name>ФормированиеРезервовПоСомнительнымДолгам</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеРасходовПриУСН</name>
  </enumValues>
  <enumValues>
    <name>РасчетНалогаУСН</name>
  </enumValues>
  <enumValues>
    <name>ПризнаниеВНУАрендныхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеФинансовогоРезультата</name>
  </enumValues>
  <enumValues>
    <name>ПереоценкаСуммыВВалютеФинОтчетности</name>
  </enumValues>
  <enumValues>
    <name>СписаниеУбытковПрошлыхЛет</name>
  </enumValues>
  <enumValues>
    <name>РеклассификацияДолгосрочныхАктивовОбязательств</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/ЭтапыПроверкиДокументаВРеглУчете/ЭтапыПроверкиДокументаВРеглУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыПроверкиДокументаВРеглУчете</name>
  <enumValues>
    <name>НеПроверен</name>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
  </enumValues>
  <enumValues>
    <name>КПовторнойПроверке</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/ВариантыВажностиПроблемыСостоянияСистемы/ВариантыВажностиПроблемыСостоянияСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыВажностиПроблемыСостоянияСистемы</name>
  <comment>Определяет значимость проблемы, выявленной при аудите состояния</comment>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>ВажнаяИнформация</name>
  </enumValues>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>ПолезныйСовет</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Documents/РегламентнаяОперация/РегламентнаяОперация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегламентнаяОперация</name>
  <registerRecords>InformationRegister.РасчетНалогаНаИмущество</registerRecords>
  <registerRecords>InformationRegister.РасчетСтавкиНалогаНаПрибыльЗаМесяц</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходовРаздел2</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.РасчетРезервовПоСомнительнымДолгам</registerRecords>
  <registerRecords>InformationRegister.РасчетРазницВОценкеАктивовИОбязательств</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>InformationRegister.РасчетДолейБазыНалогаНаПрибыль</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.РасчетЗемельногоНалога</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНОСиНМА</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСН</registerRecords>
  <registerRecords>InformationRegister.РасчетНормированияРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>InformationRegister.РасчетНалогаУСН</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>InformationRegister.РасчетОтложенногоНалога</registerRecords>
  <registerRecords>InformationRegister.РасчетРасходовПоАренде</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>InformationRegister.РасчетПоказателейОтложенногоНалога</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНТовары</registerRecords>
  <registerRecords>InformationRegister.ПримененныеСтавкиОтложенногоНалога</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>InformationRegister.РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль</registerRecords>
  <registerRecords>InformationRegister.ДолиСписанияКосвенныхРасходов</registerRecords>
  <registerRecords>InformationRegister.РасчетТранспортногоНалога</registerRecords>
  <registerRecords>InformationRegister.РасчетСтоимостиНалоговыхАктивовИОбязательств</registerRecords>
  <registerRecords>InformationRegister.РасчетЭффектаИзмененияСтавокНалогаНаПрибыль</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьОС</registerRecords>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

erp3l/src/CommonModules/ЗакрытиеМесяцаЛокализация/Module.bsl
#Область ПрограммныйИнтерфейс

// Заполнение таблицы этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
//
// Параметр:
//	ТаблицаЭтапов - ТаблицаЗначений - см. Обработки.ОперацииЗакрытияМесяца.ИнициализироватьТаблицуОписанияЭтапов.
//
Процедура ДополнитьОписаниеЭтаповЗакрытияМесяца(ТаблицаЭтапов) Экспорт
	//++ Локализация
	#Область Группа_РучныеОперации
	
	ТекущийРодитель = ЗакрытиеМесяцаСервер.ИдентификаторГруппыРучныеОперации();
	//++ НЕ УТ
	НалоговыйУчет.ДобавитьЭтап_ОсвобождениеОтУплатыНалоговВСвязиСКоронавирусом(ТаблицаЭтапов, ТекущийРодитель);
	ЗатратыЛокализацияСервер.ДобавитьЭтап_СписаниеЗатратНаВыпускБезРаспоряжений(ТаблицаЭтапов, ТекущийРодитель);
	ЗатратыЛокализацияСервер.ДобавитьЭтап_РаспределениеМатериаловИРаботНаСебестоимостьПродукции21(ТаблицаЭтапов, ТекущийРодитель);
	//-- НЕ УТ
	УчетНДСРФ.ДобавитьЭтап_ОформлениеСчетовФактурИТаможенныхДокументов(ТаблицаЭтапов,ТекущийРодитель); //Локализация
	//++ НЕ УТ
	УчетНДСРФ.ДобавитьЭтап_ПеречислениеНДСВБюджет(ТаблицаЭтапов,ТекущийРодитель); //Локализация
	ВнеоборотныеАктивыЛокализация.ДобавитьЭтап_ПереходНаУчетВнеоборотныхАктивовВерсии24(ТаблицаЭтапов, ТекущийРодитель);
	РеглУчетСервер.ДобавитьЭтап_ВводСведенийСреднесписочнойЧисленности(ТаблицаЭтапов, ТекущийРодитель);
	//-- НЕ УТ
	#КонецОбласти
	
	#Область Группа_ФормированиеЗатрат
	
	ТекущийРодитель = ЗакрытиеМесяцаСервер.ИдентификаторГруппыФормированиеЗатрат();
	//++ НЕ УТ
	ИнтеграцияБЗК.ДобавитьЭтап_ОтражениеЗарплатыВФинансовомУчете(ТаблицаЭтапов, ТекущийРодитель);
	ИнтеграцияБЗК.ДобавитьЭтап_НачислениеОценочныхОбязательствРезервовПоОтпускам(ТаблицаЭтапов, ТекущийРодитель);
	//-- НЕ УТ
	ПодарочныеСертификатыСервер.ДобавитьЭтап_АннулированиеПодарочныхСертификатов(ТаблицаЭтапов,ТекущийРодитель);
	//++ НЕ УТ
	ВнеоборотныеАктивыЛокализация.ДобавитьЭтап_ПризнаниеВНалоговомУчетеАрендныхПлатежей(ТаблицаЭтапов,ТекущийРодитель);
	ТМЦВЭксплуатацииСервер.ДобавитьЭтап_ПогашениеСтоимостиТМЦВЭксплуатации(ТаблицаЭтапов, ТекущийРодитель);
	ВнеоборотныеАктивыЛокализация.ДобавитьЭтап_РасчетНалогаНаИмущество(ТаблицаЭтапов, ТекущийРодитель);
	ВнеоборотныеАктивыЛокализация.ДобавитьЭтап_РасчетТранспортногоНалога(ТаблицаЭтапов, ТекущийРодитель);
	ВнеоборотныеАктивыЛокализация.ДобавитьЭтап_РасчетЗемельногоНалога(ТаблицаЭтапов, ТекущийРодитель);
	Документы.РегламентнаяОперация.ДобавитьЭтап_РасчетТорговогоСбора(ТаблицаЭтапов, ТекущийРодитель);
	//-- НЕ УТ
	//++ НЕ УТКА
	МеждународныйУчетВнеоборотныеАктивы.ДобавитьЭтап_НачислениеАмортизацииОСиНМАМеждународныйУчет(ТаблицаЭтапов, ТекущийРодитель);
	//-- НЕ УТКА
	#КонецОбласти
	
	#Область Группа_РегламентированныйУчет
	
	ТекущийРодитель = ЗакрытиеМесяцаСервер.ИдентификаторГруппыРегламентированныйУчет();
	УчетНДСРФ.ДобавитьЭтап_ФормированиеСводныхСправокНДС(ТаблицаЭтапов, ТекущийРодитель);
	//++ НЕ УТ
	РеглУчетСервер.ДобавитьЭтап_ОтражениеДокументовВРегламентированномУчете(ТаблицаЭтапов, ТекущийРодитель);
	РеглУчетСервер.ДобавитьЭтап_РеклассификацияДолгосрочныхАктивовОбязательств(ТаблицаЭтапов, ТекущийРодитель);	
	Документы.РегламентнаяОперация.ДобавитьЭтап_РасчетКурсовыхРазниц(ТаблицаЭтапов, ТекущийРодитель);
	РеглУчетСервер.ДобавитьЭтап_ФормированиеФинансовогоРезультата(ТаблицаЭтапов,ТекущийРодитель);
	//-- НЕ УТ
	#КонецОбласти
	
	//++ НЕ УТ 
	#Область Группа_УчетПоУСН
	
	ТекущийРодитель = ИдентификаторГруппыУчетПоУСН();
	УчетУСНПСНСервер.ДобавитьЭтап_ПризнаниеРасходовПриУСН(ТаблицаЭтапов, ТекущийРодитель);
	УчетУСНПСНСервер.ДобавитьЭтап_СторноДоходовКУДиР(ТаблицаЭтапов, ТекущийРодитель);
	УчетУСНПСНСервер.ДобавитьЭтап_РасчетНалогаУСН(ТаблицаЭтапов, ТекущийРодитель);
	
	#КонецОбласти
	//-- НЕ УТ

	//-- Локализация
КонецПроцедуры

// Заполнение таблицы групп этапов закрытия месяца.
// Элементы данной таблицы являются элементами верхнего уровня в дереве этапов в форме закрытия месяца.
//
// Параметр:
//	ТаблицаГруппЭтапов - ТаблицаЗначений - см. Обработки.ОперацииЗакрытияМесяца.ИнициализироватьТаблицуОписанияГруппЭтапов().
//
Процедура ДополнитьОписаниеГруппЭтаповЗакрытияМесяца(ТаблицаГруппЭтапов) Экспорт
	//++ Локализация

	//++ НЕ УТ
	НоваяСтрока = ТаблицаГруппЭтапов.Вставить(ТаблицаГруппЭтапов.Количество()-1);
	НоваяСтрока.Код = ИдентификаторГруппыУчетПоУСН();
	НоваяСтрока.Наименование = НСтр("ru = 'Учет по УСН';
									|en = 'STS accounting'");
	//-- НЕ УТ
	
	//-- Локализация
КонецПроцедуры

// Заполняет проверки, выполняемые в рамках закрытия месяца.
//
// Параметры:
//	ТаблицаПроверок - ТаблицаЗначений - см. АудитСостоянияСистемыПереопределяемый.ЗаполнитьПроверкиДляРегистрации().
//
Процедура ДополнитьПроверкиДляРегистрации(ТаблицаПроверок) Экспорт
	//++ Локализация
	УчетНДСРФ.ОписаниеПроверок_ФормированиеСводныхСправокНДС(ТаблицаПроверок);
	УчетНДСРФ.ОписаниеПроверок_ФормированиеДвиженийПоНДС(ТаблицаПроверок);
	//++ НЕ УТ
	ЗатратыЛокализацияСервер.ОписаниеПроверок_СписаниеЗатратНаВыпускБезРаспоряжений(ТаблицаПроверок);
	ЗатратыЛокализацияСервер.ОписаниеПроверок_РаспределениеМатериаловИРаботНаСебестоимостьПродукции21(ТаблицаПроверок);
	//-- НЕ УТ
	//-- Локализация
КонецПроцедуры


// Дополняет список операций закрытия месяца, использующих механизм заданий к закрытию месяца.
// 
// Параметры:
// 	ДанныеВыбора - СписокЗначений -
//
Процедура ДополнитьДанныеВыбораОперацийЗакрытияМесяца(ДанныеВыбора) Экспорт
	//++ Локализация
	//++ НЕ УТ
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииОС);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.НачислениеАмортизацииНМА);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПризнаниеВНалоговомУчетеАрендныхПлатежей);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПогашениеСтоимостиТМЦВЭксплуатации);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетТранспортногоНалога);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетЗемельногоНалога);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.СторноДоходовКУДиР);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПризнаниеРасходовПриУСН);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаУСН);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РеклассификацияДолгосрочныхАктивовОбязательств);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата);
	//-- НЕ УТ
	//-- Локализация
КонецПроцедуры

//++ НЕ УТ

// Проверяет использование регламентированного учета в рассчитываемом периоде.
//
// Параметры:
//	ПараметрыОбработчика - Структура - параметры обработчика события этапа.
//	ИзменятьСостояниеЭтапа - Булево -
//	
// Возвращаемое значение:
//	Булево - признак использования регламентированного учета.
//
Функция ПроверитьИспользованиеРегламентированногоУчета(ПараметрыОбработчика, ИзменятьСостояниеЭтапа = Истина) Экспорт
	
	Результат = Ложь;

	//++ Локализация
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет") Тогда
		
		Если ИзменятьСостояниеЭтапа Тогда
			
			ЗакрытиеМесяцаСервер.УстановитьСостояниеОтключено(
				ПараметрыОбработчика,
				НСтр("ru = 'Регламентированный учет не ведется.';
					|en = 'Local accounting is not kept.'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
		КонецЕсли;
		
		Результат =  Ложь;
		
	Иначе
		
		ДатаНачалаВеденияРеглУчета = НачалоМесяца(Константы.ДатаНачалаВеденияРеглУчета.Получить());
		
		Если ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации < ДатаНачалаВеденияРеглУчета Тогда
			
			Если ИзменятьСостояниеЭтапа Тогда
				
				ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
					ПараметрыОбработчика,
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Регламентированный учет ведется начиная с периода %1';
							|en = 'Local accounting is kept from period %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
						РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ДатаНачалаВеденияРеглУчета)));
				
			КонецЕсли;
			
			Результат =  Ложь;
		Иначе
			Результат =  Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	//-- Локализация
	Возврат Результат;
	
КонецФункции

// Проверяет наличие документов "Регламентная операция".
//
// Параметры:
//	ПараметрыОбработчика 			   - Структура - параметры обработчика события этапа
//	ТипОперации							- Неопределено 		 			   
//++ Локализация
//										- ПеречислениеСсылка.ТипыРегламентныхОпераций - тип операции документа
//-- Локализация
//											если не указан, то анализируется типы операций из свойства ТипыРегламентныхОпераций данного этапа
//	ИмяТаблицыОтбораОрганизаций 	   - Строка - имя временной таблицы для отбора документов по организациям
//											организации в указанной таблице должны находиться в поле с именем "Ссылка"
//											если таблица не указана, то отбираются все организации из свойства МассивОрганизаций
//	ДляЭтапаИспользуетсяРегистрЗаданий - Булево - признак того, что для данного этапа используется один из регистров "ЗаданияК...".
//	
// Возвращаемое значение:
//	Булево - признак наличия документов.
//
Функция ПроверитьНаличиеДокументаРегламентнаяОперация(ПараметрыОбработчика, Знач ТипОперации = Неопределено,
			ИмяТаблицыОтбораОрганизаций = "", ДляЭтапаИспользуетсяРегистрЗаданий = Истина) Экспорт
	
	ЕстьОшибки    = Ложь;
	//++ Локализация
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	
	Если НЕ ЗначениеЗаполнено(ИмяТаблицыОтбораОрганизаций) Тогда
		
		// Проверка по всем рассчитываемым организациям.
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Организации.Ссылка
		|ПОМЕСТИТЬ ВТОрганизации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка В(&МассивОрганизаций)";
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Операции.Ссылка    КАК ТипОперации,
	|	Организации.Ссылка КАК Организация
	|ПОМЕСТИТЬ ВТОперации
	|ИЗ
	|	Перечисление.ТипыРегламентныхОпераций КАК Операции
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОрганизации КАК Организации
	|		ПО ИСТИНА
	|ГДЕ
	|	Операции.Ссылка В (&ТипыОпераций)
	|	И НЕ (Организации.Ссылка ЕСТЬ NULL)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Операции.ТипОперации КАК ТипОперации,
	|	Операции.Организация КАК Организация,
	|	Организации.Ссылка.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	КОЛИЧЕСТВО(РегламентнаяОперация.Ссылка) КАК КоличествоДокументов
	|ИЗ
	|	ВТОперации КАК Операции
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегламентнаяОперация КАК РегламентнаяОперация
	|		ПО (РегламентнаяОперация.Организация = Операции.Организация)
	|			И (РегламентнаяОперация.ТипОперации = Операции.ТипОперации)
	|			И (РегламентнаяОперация.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|			И (РегламентнаяОперация.Проведен)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Операции.Организация = Организации.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Операции.ТипОперации,
	|	Операции.Организация,
	|	Организации.Ссылка.ОбособленноеПодразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Операции.ТипОперации,
	|	Операции.Организация";
	
	Если ЗначениеЗаполнено(ИмяТаблицыОтбораОрганизаций) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТОрганизации", ИмяТаблицыОтбораОрганизаций);
	КонецЕсли;
	
	ЕстьДокументы = Ложь;
	Период 		  = РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации);
	ТипыОпераций  = ?(ЗначениеЗаполнено(ТипОперации),
		ОбщегоНазначенияУТКлиентСервер.Массив(ТипОперации),
		ПараметрыОбработчика.ДанныеЭтапа.ТипыРегламентныхОпераций);
		
	Запрос.УстановитьПараметр("ТипыОпераций", ТипыОпераций);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, Выборка.Количество());
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ОбособленноеПодразделение
		 И НЕ Документы.РегламентнаяОперация.ОперацияИспользуетсяДляОбособленногоПодразделения(Выборка.ТипОперации) Тогда
			Продолжить;
		КонецЕсли;
		
		// Для ПереоценкаСуммыВВалютеФинОтчетности и ЗакрытиеГода будем выводить сообщения об ошибках только если в отборе
		// присутствует искомая организация:
		Если Выборка.ОбособленноеПодразделение И Не ПараметрыОбработчика.ПараметрыРасчета.ВсеОрганизации
			И ПараметрыОбработчика.ПараметрыРасчета.МассивОрганизаций.Найти(Выборка.Организация) = Неопределено
			И (Выборка.ТипОперации = Перечисления.ТипыРегламентныхОпераций.ПереоценкаСуммыВВалютеФинОтчетности
			ИЛИ Выборка.ТипОперации = Перечисления.ТипыРегламентныхОпераций.ЗакрытиеГода) Тогда
				Продолжить;
		КонецЕсли;
		
		Если Выборка.КоличествоДокументов > 1 Тогда
			
			ЕстьОшибки = Истина;
			ЗакрытиеМесяцаСервер.УстановитьСостояниеНеВыполнен(
				ПараметрыОбработчика,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'По организации ""%1"" за период %2 сформировано несколько документов регламентных операций ""%3"".';
						|en = 'Several documents of the ""%3"" period-end operations were generated for the ""%1"" company for period %2.'", ОбщегоНазначения.КодОсновногоЯзыка()),
					Выборка.Организация,
					Период,
					СокрЛП(Выборка.ТипОперации)));
					
			Продолжить;
			
		ИначеЕсли Выборка.КоличествоДокументов = 0 Тогда
			
			Если ДляЭтапаИспользуетсяРегистрЗаданий Тогда
				// Нет заданий к расчету и нет регламентного документа - расчет не требуется.
			Иначе
				// Есть данные для расчета (иначе эта процедура не вызывалась бы), но нет регламентного документа - расчет не выполнен.
				ЕстьОшибки = Истина;
				ЗакрытиеМесяцаСервер.УстановитьСостояниеНеВыполнен(
					ПараметрыОбработчика,
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'По организации ""%1"" за период %2 не сформирована регламентная операция ""%3"".';
							|en = 'The ""%3"" period-end operation was not generated for the ""%1"" company for period %2.'", ОбщегоНазначения.КодОсновногоЯзыка()),
						Выборка.Организация,
						Период,
						СокрЛП(Выборка.ТипОперации)));
			КонецЕсли;
			
		Иначе // есть один документ
			ЕстьДокументы = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДляЭтапаИспользуетсяРегистрЗаданий И НЕ ЕстьОшибки И НЕ ЕстьДокументы Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'За период %1 нет заданий для расчета данной операции и отсутствует документ ""Регламентная операция"".';
					|en = 'No jobs for calculating this operation and no ""Period-end operation"" document for period %1.'", ОбщегоНазначения.КодОсновногоЯзыка()),
				Период));
		
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос,
		"ВТОперации" + ?(НЕ ЗначениеЗаполнено(ИмяТаблицыОтбораОрганизаций), ", ВТОрганизации", ""));
	//-- Локализация	
	Возврат НЕ ЕстьОшибки;
	
КонецФункции

// Описание действия "Открыть форму списка документов ""Регламентная операция""".
// Отбор по типам операций берется из свойства ТипыРегламентныхОпераций описания этапа закрытия месяца.
//
// Возвращаемое значение:
//	Структура - см. СтруктураОписанияДействия().
//
Функция ОписаниеДействия_ОткрытьСписокДокументовРегламентнаяОперация() Экспорт
	Описание = Неопределено;
	//++ Локализация
	Описание = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РегламентнаяОперация.Формы.ФормаСписка.ПолноеИмя(),
		Истина);
	//-- Локализация
	Возврат Описание;
	
КонецФункции

// Возвращает текст запроса для определения состояния отражения документов в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - текст запроса для определения состояния отражения документов.
//
Функция ТекстЗапросаСостояниеОтраженияДокументов() Экспорт
	ТекстЗапроса = "";
	//++ Локализация
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ДанныеРегистра.ДатаОтражения) КАК ДатаОкончания,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеРегистра.Регистратор) КАК Количество
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ДатаНачалаВеденияРеглУчета КАК ДатаНачалаВеденияРеглУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&ИспользоватьРеглУчет
	|	И ДанныеРегистра.ДатаОтражения >= ДатаНачалаВеденияРеглУчета.Значение
	|	И ДанныеРегистра.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияДокументовВРеглУчете.ОтраженоВРеглУчете)
	|	И ДанныеРегистра.ДатаОтражения <= &КонецПериода
	|	И (ДанныеРегистра.Организация В (&МассивОрганизаций)
	|		ИЛИ &ПоВсемОрганизациям)
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ДанныеРегистра.Регистратор) > 0
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ДанныеРегистра.ДатаОтражения) КАК ДатаНачала,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеРегистра.Регистратор) КАК Количество
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПроверкиДокументов КАК ДанныеПроверки
	|		ПО ДанныеРегистра.Регистратор = ДанныеПроверки.Документ
	|			И ДанныеРегистра.Организация = ДанныеПроверки.Организация
	|			И ДанныеПроверки.СтатусПроверки = ЗНАЧЕНИЕ(Перечисление.ЭтапыПроверкиДокументаВРеглУчете.Проверен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&ИспользоватьРеглУчет
	|	И (Константы.ОтражатьВРеглУчетеТолькоПроверенныеДокументы И НЕ ДанныеПроверки.Документ ЕСТЬ NULL
	|		ИЛИ НЕ Константы.ОтражатьВРеглУчетеТолькоПроверенныеДокументы
	|		ИЛИ НЕ ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В (&СписокПроверяемыхТиповДокументов))
	|	И ДанныеРегистра.ДатаОтражения >= Константы.ДатаНачалаВеденияРеглУчета
	|	И ДанныеРегистра.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияДокументовВРеглУчете.КОтражениюВРеглУчете)
	|	И ДанныеРегистра.ДатаОтражения <= &КонецПериода
	|	И (ДанныеРегистра.Организация В (&МассивОрганизаций)
	|		ИЛИ &ПоВсемОрганизациям)
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ДанныеРегистра.Регистратор) > 0
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ДанныеРегистра.ДатаОтражения) КАК ДатаНачала,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеРегистра.Регистратор) КАК Количество
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ДатаНачалаВеденияРеглУчета КАК ДатаНачалаВеденияРеглУчета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&ИспользоватьРеглУчет
	|	И ДанныеРегистра.ДатаОтражения >= ДатаНачалаВеденияРеглУчета.Значение
	|	И ДанныеРегистра.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияДокументовВРеглУчете.НеУказаныСчетаУчета)
	|	И ДанныеРегистра.ДатаОтражения <= &КонецПериода
	|	И (ДанныеРегистра.Организация В (&МассивОрганизаций)
	|		ИЛИ &ПоВсемОрганизациям)
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеРегистра.Регистратор) > 0
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ДанныеРегистра.ДатаОтражения) КАК ДатаНачала,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеРегистра.Регистратор) КАК Количество
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ДанныеРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПроверкиДокументов КАК ДанныеПроверки
	|		ПО ДанныеРегистра.Регистратор = ДанныеПроверки.Документ
	|			И ДанныеРегистра.Организация = ДанныеПроверки.Организация
	|			И ДанныеПроверки.СтатусПроверки <> ЗНАЧЕНИЕ(Перечисление.ЭтапыПроверкиДокументаВРеглУчете.Проверен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	&ИспользоватьРеглУчет
	|	И Константы.ОтражатьВРеглУчетеТолькоПроверенныеДокументы
	|	И ДанныеРегистра.ДатаОтражения >= Константы.ДатаНачалаВеденияРеглУчета
	|	И ДанныеРегистра.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияДокументовВРеглУчете.КОтражениюВРеглУчете)
	|	И ДанныеРегистра.ДатаОтражения <= &КонецПериода
	|	И (ДанныеРегистра.Организация В (&МассивОрганизаций)
	|		ИЛИ &ПоВсемОрганизациям)
	|	И НЕ ДанныеПроверки.Документ ЕСТЬ NULL
	|	И ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В (&СписокПроверяемыхТиповДокументов)
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеРегистра.Регистратор) > 0
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИспользоватьРеглУчет", ?(ПолучитьФункциональнуюОпцию("ИспользоватьРеглУчет"), "ИСТИНА", "ЛОЖЬ"));
	
	СписокПроверяемыхТипов = ПроверкаДокументовСервер.ПроверяемыеТипыДокументов();
	МассивИменТиповДокументов = Новый Массив;
	
	Для Каждого ПроверяемыйТип Из СписокПроверяемыхТипов Цикл
		МассивИменТиповДокументов.Добавить("ТИП(Документ."+Метаданные.НайтиПоТипу(ПроверяемыйТип).Имя+")");
	КонецЦикла;
	
	СтрокаИменПроверяемыхТипов = СтрСоединить(МассивИменТиповДокументов, ",");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СписокПроверяемыхТиповДокументов", СтрокаИменПроверяемыхТипов);
	//-- Локализация
	Возврат ТекстЗапроса;
КонецФункции
//-- НЕ УТ

#Область ФормированиеЗаданийКЗакрытиюМесяца

// Дополняет текст запроса механизма формирования заданий закрытия месяца.
// 
// Параметры:
// 	Запрос - Запрос - используется для установки параметров запроса.
// 	ТекстЗапроса - Строка - строка с текстом запроса.
// 	ТекстЗапросаВременныхТаблиц - Строка - строка с текстом запроса временных таблиц.
// 	ИменаВременныхТаблиц - Строка - массив имен создаваемых временных таблиц для последующего уничтожения.
Процедура ДополнитьТекстЗапросаЗаданийКЗакрытиюМесяца(Запрос, ТекстЗапроса, ТекстЗапросаВременныхТаблиц, ИменаВременныхТаблиц) Экспорт
	//++ Локализация
	//++ НЕ УТ
	УчетУСНПСНСервер.ДополнитьТекстЗапросаЗаданийКЗакрытиюМесяца(Запрос,
		ТекстЗапроса,
		ТекстЗапросаВременныхТаблиц,
		ИменаВременныхТаблиц);
	//-- НЕ УТ
	//-- Локализация
КонецПроцедуры

#КонецОбласти

//++ НЕ УТ
#Область ФормированиеРегламентныхДокументов

// Формирует документы "Регламентная операция" начиная с первого пересчитываемого периода до текущего рассчитываемого периода.
//
// Параметры:
//	ПараметрыОбработчика - Структура - параметры обработчика события этапа
//	ПоОрганизациямДляКоторыхЕстьЗадания	- Булево - 
//	
Процедура РасчетРегламентныхОперацийНачинаяСПервогоЗадания(ПараметрыОбработчика, ПоОрганизациямДляКоторыхЕстьЗадания) Экспорт
	//++ Локализация
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	НачалоРасчета = ЗакрытиеМесяцаСервер.НачалоРасчета(
		ПараметрыОбработчика.ДанныеЭтапа.Код,
		ПараметрыОбработчика.ПараметрыРасчета.КонецПериода,,
		ПараметрыОбработчика.ПараметрыРасчета.МассивОрганизаций);
	
	ТипыОпераций = ПараметрыОбработчика.ДанныеЭтапа.ТипыРегламентныхОпераций;
	
	ЕстьОшибки = Ложь;
	
	Пока НачалоРасчета <= ПараметрыОбработчика.ПараметрыРасчета.КонецПериода Цикл
		
		ИмяКлючевойОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ЗакрытиеМесяца.%1",
			СокрЛП(ПараметрыОбработчика.ДанныеЭтапа.Код));
		ОписаниеЗамера 		= ОценкаПроизводительности.НачатьЗамерДлительнойОперации(ИмяКлючевойОперации);
		КоличествоДанных	= 0;
		
		НомерЗадания 	 	= ЗакрытиеМесяцаСервер.УвеличитьНомерЗадания();
		ОкончаниеПериода 	= КонецМесяца(НачалоРасчета);
		
		НачатьТранзакцию();
		
		Попытка
			
			 ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(
				НомерЗадания,
				ПараметрыРасчета.МассивОрганизаций,
				ПараметрыОбработчика.ДанныеЭтапа.Код);
			
			ДанныеКРасчетуЗаМесяц =  ЗакрытиеМесяцаСервер.ЗаданияКРасчетуЗаМесяц(
				НачалоРасчета,
				ОкончаниеПериода,
				НомерЗадания,
				ПараметрыРасчета.МассивОрганизаций,
				ПараметрыОбработчика.ДанныеЭтапа.Код);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При выполнении расчета за период %1 произошла ошибка:
					|%2';
					|en = 'An error occurred when calculating for the %1 period: 
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			 ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
				ПараметрыОбработчика,
				ТекстОшибки,
				ПараметрыРасчета.МассивОрганизаций,
				НачалоРасчета);
			
		КонецПопытки;
		
		Если ПоОрганизациямДляКоторыхЕстьЗадания Тогда
			
			Для каждого Организация Из ДанныеКРасчетуЗаМесяц.Организация Цикл
				
				Для Каждого ТипОперации Из ТипыОпераций Цикл
					
					Если НЕ ТребуетсяРегламентнаяОперацияВУказанномПериоде(ТипОперации, НачалоРасчета) Тогда
						Продолжить;
					КонецЕсли; 
					
					РезультатРасчета = СформироватьДокументРегламентнаяОперация(
											ПараметрыОбработчика, 
											ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация),
											ТипОперации, 
											НачалоРасчета);
											
					Если РезультатРасчета <> Неопределено Тогда
						Если ЗначениеЗаполнено(РезультатРасчета.ТекстОшибки)
							ИЛИ РезультатРасчета.СписокОшибок.Количество() <> 0 Тогда
							ЕстьОшибки = Истина;
						Иначе
							КоличествоДанных = КоличествоДанных + РезультатРасчета.КоличествоДанных;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
			
			КонецЦикла; 
			
		ИначеЕсли ДанныеКРасчетуЗаМесяц.Организация.Количество() <> 0 Тогда
			
			Для Каждого ТипОперации Из ТипыОпераций Цикл
				
				Если НЕ ТребуетсяРегламентнаяОперацияВУказанномПериоде(ТипОперации, НачалоРасчета) Тогда
					Продолжить;
				КонецЕсли; 
				
				РезультатРасчета = СформироватьДокументРегламентнаяОперация(
										ПараметрыОбработчика, 
										ПараметрыОбработчика.ПараметрыРасчета.МассивОрганизаций,
										ТипОперации, 
										НачалоРасчета);
										
				Если РезультатРасчета <> Неопределено Тогда
					Если ЗначениеЗаполнено(РезультатРасчета.ТекстОшибки)
						ИЛИ РезультатРасчета.СписокОшибок.Количество() <> 0 Тогда
						ЕстьОшибки = Истина;
					Иначе
						КоличествоДанных = КоличествоДанных + РезультатРасчета.КоличествоДанных;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЕстьОшибки Тогда
			Прервать;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			 ЗакрытиеМесяцаСервер.ЗаблокироватьРегистрЗаданий(
				НомерЗадания,
				ПараметрыРасчета.МассивОрганизаций,
				ПараметрыОбработчика.ДанныеЭтапа.Код);
			
			 ЗакрытиеМесяцаСервер.ЗафиксироватьРасчет(
				Неопределено,
				НомерЗадания,
				ПараметрыОбработчика.ДанныеЭтапа.Код,
				ДанныеКРасчетуЗаМесяц);
			
			РегистрыСведений.ЗаданияКЗакрытиюМесяца.СформироватьЗаданияНаСледующийПериод(
				ДанныеКРасчетуЗаМесяц.ВременныеТаблицы,
				ОкончаниеПериода + 1);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При выполнении расчета за период %1 произошла ошибка:
					|%2';
					|en = 'An error occurred when calculating for the %1 period: 
					|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
				РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			 ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
				ПараметрыОбработчика,
				ТекстОшибки,
				ПараметрыРасчета.МассивОрганизаций,
				НачалоРасчета);
			
		КонецПопытки;
		
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, КоличествоДанных);
		
		НачалоРасчета = ОкончаниеПериода + 1;
		
	КонецЦикла;
	//-- Локализация
КонецПроцедуры

// Формирует документы "Регламентная операция" за один период.
//
// Параметры:
//	ПараметрыОбработчика - Структура - параметры обработчика события этапа
//	МассивОрганизаций - Массив -
//	ТипОперации 		 - Неопределено
//++ Локализация
//						 - ПеречислениеСсылка.ТипыРегламентныхОпераций - тип операции документа
//-- Локализация
//							если не указан, то создаются документы со всеми типами операций из свойства ТипыРегламентныхОпераций данного этапа
//	Период 				 - Дата, Неопределено - период для формирования документов;
//							если период не указан, то формируются документы за текущий рассчитываемый период.
//	
// Возвращаемое значение:
//	Структура - результат формирования документов, см. Документы.РегламентнаяОперация.РассчитатьРегламентныеОперации()
//		если типы операций не определен, то возвращается значение Неопределено.
//
Функция СформироватьДокументРегламентнаяОперация(ПараметрыОбработчика, МассивОрганизаций, Знач ТипОперации = Неопределено, Знач Период = Неопределено) Экспорт
	РезультатРасчета = Неопределено;
	//++ Локализация
	ТипыОпераций = ?(ЗначениеЗаполнено(ТипОперации),
		ОбщегоНазначенияУТКлиентСервер.Массив(ТипОперации),
		ПараметрыОбработчика.ДанныеЭтапа.ТипыРегламентныхОпераций);
	
	ТипыВыполняемыхОпераций = Новый Массив;
	
	Период = ?(ЗначениеЗаполнено(Период), Период, ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации);
	
	Для Каждого ТипОперации Из ТипыОпераций Цикл
		
		Если ТребуетсяРегламентнаяОперацияВУказанномПериоде(ТипОперации, Период) Тогда
			ТипыВыполняемыхОпераций.Добавить(ТипОперации);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипыВыполняемыхОпераций.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатРасчета = Документы.РегламентнаяОперация.РассчитатьРегламентныеОперации(
		Период,
		ТипыВыполняемыхОпераций,
		МассивОрганизаций);
	
	Если ЗначениеЗаполнено(РезультатРасчета.ТекстОшибки) Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'По организации ""%1"" за период %2 не удалось провести регламентную операцию ""%3"" по причине:
				|%4';
				|en = 'Cannot post the ""%3"" period-end operation for the ""%1"" company for period %2 due to:
				|%4'", ОбщегоНазначения.КодОсновногоЯзыка()),
			СокрЛП(РезультатРасчета.Организация),
			РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(Период),
			СокрЛП(РезультатРасчета.ТипОперации),
			РезультатРасчета.ТекстОшибки);
		
		ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
			ПараметрыОбработчика,
			ТекстОшибки,
			?(ЗначениеЗаполнено(РезультатРасчета.Организация), РезультатРасчета.Организация, МассивОрганизаций),
			Период,
			,
			РезультатРасчета.ДокументСОшибкой);
		
	КонецЕсли;
	
	Для каждого ОписаниеОшибки Из РезультатРасчета.СписокОшибок Цикл
		
		ПараметрыРегистрации =  ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемыРасчета(
			ПараметрыОбработчика.ДанныеЭтапа.Код,
			ОписаниеОшибки.Организация,
			Период);
			
		ГруппаПроблем = НСтр("ru = 'При выполнении операции были диагностированы ошибки';
							|en = 'Errors were found when executing the operation'", ОбщегоНазначения.КодОсновногоЯзыка());
			
		ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемуВыполненияРасчета(
			ПараметрыРегистрации,
			ГруппаПроблем,
			Перечисления.ВариантыВажностиПроблемыСостоянияСистемы.Ошибка,
			ОписаниеОшибки.ОписаниеПроблемы,
			ОписаниеОшибки.Объект);
			
	КонецЦикла; 
	//-- Локализация
	Возврат РезультатРасчета;
КонецФункции

// Возвращает требуемую периодичность указанной регламентной операции.
//
// Параметры:
//	ТипОперации - Неопределено
//++ Локализация
//					- ПеречислениеСсылка.ТипыРегламентныхОпераций - тип операции документа
//-- Локализация
//
// Возвращаемое значение:
//	 ПеречислениеСсылка.Периодичность - периодичность операции.
//
Функция ПериодичностьРегламентнойОперации(ТипОперации) Экспорт
	Периодичность = Неопределено;
	//++ Локализация
	Если ТипОперации = Перечисления.ТипыРегламентныхОпераций.РасчетНалогаНаИмущество
	 ИЛИ ТипОперации = Перечисления.ТипыРегламентныхОпераций.РасчетТранспортногоНалога
	 ИЛИ ТипОперации = Перечисления.ТипыРегламентныхОпераций.РасчетЗемельногоНалога
	 ИЛИ ТипОперации = Перечисления.ТипыРегламентныхОпераций.РасчетТорговогоСбора
	 ИЛИ ТипОперации = Перечисления.ТипыРегламентныхОпераций.РасчетНалогаУСН Тогда
	 
		Периодичность = Перечисления.Периодичность.Квартал;
		
	ИначеЕсли ТипОперации = Перечисления.ТипыРегламентныхОпераций.ЗакрытиеГода Тогда
		
		Периодичность = Перечисления.Периодичность.Год;
		
	Иначе
		
		Периодичность = Перечисления.Периодичность.Месяц;
		
	КонецЕсли;
	//-- Локализация
	Возврат Периодичность;
	
КонецФункции

// Проверяет совпадение указанного периода и периодичности регламентной операции.
//
// Параметры:
//	ТипОперации - Неопределено
//++ Локализация
//				- ПеречислениеСсылка.ТипыРегламентныхОпераций - тип операции документа
//-- Локализация
//	Период 		- Дата - период для формирования документа по данной операции.
//
// Возвращаемое значение:
//	 Булево - признак необходимости формирования документа.
//
Функция ТребуетсяРегламентнаяОперацияВУказанномПериоде(ТипОперации, Период) Экспорт
	Результат = Ложь;
	
	//++ Локализация
	Периодичность = ПериодичностьРегламентнойОперации(ТипОперации);
	
	Если Периодичность = Перечисления.Периодичность.Месяц Тогда
		Результат = Истина;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Результат = (Месяц(Период) % 3 = 0);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		Результат = (Месяц(Период) = 12);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неверная периодичность регламентной операции';
								|en = 'Incorrect frequency of period-end operation'");
	КонецЕсли; 
	//-- Локализация	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервереФормаЗакрытиеМесяца(Отказ, СтандартнаяОбработка, Форма) Экспорт
	//++ Локализация
	//-- Локализация
	Возврат;
КонецПроцедуры


// Настраивает форму закрытия месяца.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - 
// 	ВыполняетсяЗагрузкаНастроек - Булево -
//
Процедура НастроитьЭлементыПриИнициализацииФормы(Форма, ВыполняетсяЗагрузкаНастроек = Ложь) Экспорт
	//++ Локализация
	Элементы = Форма.Элементы;
	Если НЕ ВыполняетсяЗагрузкаНастроек Тогда
		
		Элементы.ФормаОткрытьЗаданияКПогашениюСтоимостиТМЦ.Видимость =
			Ложь // в УТ11
			//++ НЕ УТ
			ИЛИ ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ЗаданияКПогашениюСтоимостиТМЦВЭксплуатации)
			//-- НЕ УТ
			ИЛИ Ложь; // для соблюдение стандарта по переносу выражений	
			
	КонецЕсли;
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область РаботаСДатами

// Добавляет описания регистров для их подключения к механизму дат запрета изменения.
//
// Параметры:
//  ИсточникиДанных - ТаблицаЗначений - см. описание в механизме БСП.
//
Процедура ДополнитьОписаниеРегистровДляКонтроляДатЗапретаИзменения(ИсточникиДанных) Экспорт
	//++ Локализация
	//++ НЕ УТ
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.ДенежныеДокументы.ПолноеИмя(),
										"Период",
										"ФинансовыйКонтур",
										"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.КнигаУчетаДоходовИРасходов.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.РасходыПриУСН.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.РасходыПриУСНМатериалы.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.РасходыПриУСНОСиНМА.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.РасходыПриУСНТовары.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыСведений.СпособыОтраженияРасходовПоИмущественнымНалогам.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыСведений.РегистрацияЗемельныхУчастков.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыСведений.РегистрацияТранспортныхСредств.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных,
										Метаданные.РегистрыНакопления.ВыпускПродукции.ПолноеИмя(),
										"Период",
										"РегламентныеОперации",
										"Организация");
	//-- НЕ УТ
	//-- Локализация
КонецПроцедуры

// Возвращает дату задания на текущий период в зависимости от операции.
// 
// Параметры:
// 	Операция - ПеречислениеСсылка.ОперацииЗакрытияМесяца - операция закрытия месяца.
// 	Организация - СправочникСсылка.Организации - ссылка на организацию.
// 	ДокументЗадания - ДокументСсылка - документ задания.
// 	Период - Дата - дата задания.
// Возвращаемое значение:
// 	Дата - дата задания
//
Функция ДатаЗаданияНаТекущийПериод(Операция, Организация, ДокументЗадания, Знач Период) Экспорт
	Месяц = Период;
	//++ Локализация
	//++ НЕ УТ
	Если Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество 
			И НЕ РасчетИмущественныхНалоговУП.УплачиваютсяАвансыПоНалогуНаИмущество(Организация, Период)
		
		ИЛИ Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетЗемельногоНалога 
			И НЕ РасчетИмущественныхНалоговУП.УплачиваютсяАвансыПоЗемельномуНалогу(Организация, Период)
			
		ИЛИ Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетТранспортногоНалога 
			И НЕ РасчетИмущественныхНалоговУП.УплачиваютсяАвансыПоТранспортномуНалогу(Организация, Период) Тогда
		
		Месяц = НачалоМесяца(КонецГода(Период));
	КонецЕсли;
	//-- НЕ УТ
	
	//-- Локализация
	Возврат Месяц
	
КонецФункции

// Возвращает дату задания на следующий период в зависимости от операции.
// 
// Параметры:
// 	Операция - ПеречислениеСсылка.ОперацииЗакрытияМесяца - операция закрытия месяца.
// 	Организация - СправочникСсылка.Организации - ссылка на организацию.
// 	ДокументЗадания - ДокументСсылка - документ задания.
// 	СледующийМесяц - Дата - дата задания.
// Возвращаемое значение:
// 	Дата - дата задания
//
Функция ДатаЗаданияНаСледующийПериод(Операция, Организация, ДокументЗадания, Знач СледующийМесяц) Экспорт
	//++ Локализация
	//++ НЕ УТ
	
	Если Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество Тогда
		
		СледующийМесяц = ВнеоборотныеАктивыЛокализация.ПериодРасчетаНалогаНаИмущество(Организация, СледующийМесяц);
		
	ИначеЕсли Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетЗемельногоНалога Тогда
		
		СледующийМесяц = ВнеоборотныеАктивыЛокализация.ПериодРасчетаЗемельногоНалога(Организация, СледующийМесяц);
		
	ИначеЕсли Операция = Перечисления.ОперацииЗакрытияМесяца.РасчетТранспортногоНалога Тогда
		
		СледующийМесяц = ВнеоборотныеАктивыЛокализация.ПериодРасчетаТранспортногоНалога(Организация, СледующийМесяц);
		
	ИначеЕсли Операция = Перечисления.ОперацииЗакрытияМесяца.ПризнаниеВНалоговомУчетеАрендныхПлатежей Тогда
		
		СледующийМесяц = ВнеоборотныеАктивыЛокализация.СледующийПериодПризнанияВНУАрендныхПлатежей(Организация, СледующийМесяц);
		
	ИначеЕсли Операция = Перечисления.ОперацииЗакрытияМесяца.ФормированиеФинансовогоРезультата Тогда
		
		СледующийМесяц = НачалоМесяца(КонецГода(СледующийМесяц));
		
	КонецЕсли;
	
	//-- НЕ УТ
	Возврат СледующийМесяц
	//-- Локализация
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИдентификаторыГруппЭтапов

//++ Локализация
//++ НЕ УТ

Функция ИдентификаторГруппыУчетПоУСН()
	Возврат "УчетПоУСН";
КонецФункции
//-- НЕ УТ
//-- Локализация

#КонецОбласти

#КонецОбласти
